{
  "backend/main.mo": "Motoko canister managing providers, user profiles, custom provider metadata, and access control with admin/user permission checks.",
  "feature_evidence.json": "Feature evidence report listing feature IDs, affected files, components, and test requirements for error handling and readiness improvements.",
  "frontend-file-summaries.txt": "Prewritten summaries describing major frontend components, pages, and hooks related to provider navigation, error handling, and backend readiness.",
  "frontend/index.css": "Tailwind CSS setup defining light/dark theme variables and base styling for the application.",
  "frontend/index.html": "Base HTML document setting up the root DOM node and loading the main React entry point.",
  "frontend/src/App.tsx": "Configures the TanStack Router with provider-specific pages, authentication gating, and global layout.",
  "frontend/src/components/auth/AuthGate.tsx": "Component enforcing Internet Identity authentication before rendering protected content.",
  "frontend/src/components/auth/LoginButton.tsx": "Login/logout button handling Internet Identity auth state and clearing query cache on logout.",
  "frontend/src/components/auth/ProfileSetupModal.tsx": "Shows a modal prompting authenticated users without a saved profile to enter their name and stores it locally.",
  "frontend/src/components/chat/ChatbotCommandCenter.tsx": "Provides a chat UI for interacting with a provider, handling message sending, drafts, scrolling, and backend readiness.",
  "frontend/src/components/common/BackendConnectionAlert.tsx": "Displays connection errors with suggested actions and options to retry, log in, or reload.",
  "frontend/src/components/common/ErrorBoundary.tsx": "Catches component errors and displays a fallback UI with reset capability.",
  "frontend/src/components/common/NotIntegratedCallout.tsx": "Shows a simple alert indicating a feature is not yet implemented.",
  "frontend/src/components/keys/ProviderKeyManager.tsx": "Manages provider API keys, including loading, saving, editing, and handling backend connection issues.",
  "frontend/src/components/layout/AppShell.tsx": "Defines the main application layout with nav bars, outlet rendering, and profile setup modal.",
  "frontend/src/components/layout/MobileProviderNav.tsx": "Renders a mobile drawer listing AI providers and navigating between their routes.",
  "frontend/src/components/layout/MobileTopNavMenu.tsx": "Implements a mobile top navigation menu with links to core app sections.",
  "frontend/src/components/layout/TopNav.tsx": "Responsive top navigation bar with links, mobile menu toggle, and login button.",
  "frontend/src/components/providers/ProviderActionGuard.tsx": "Guards provider actions by checking backend connection and API key status before rendering children.",
  "frontend/src/components/providers/ProviderNav.tsx": "Sidebar listing all AI providers with navigation links and resolved display names.",
  "frontend/src/components/providers/ProviderToolsOptionsSection.tsx": "Renders configurable tool option fields and workflow-specific tool cards based on provider settings.",
  "frontend/src/components/providers/RecommendedPrompts.tsx": "Displays a list of suggested prompts users can click to insert into the command input.",
  "frontend/src/hooks/chat/useProviderChat.ts": "Provides chat message fetching and sending for a provider using backend actor and react‑query.",
  "frontend/src/hooks/keys/useProviderKey.ts": "Checks if a provider API key exists and provides a mutation for saving or updating it.",
  "frontend/src/hooks/providers/useCustomProviderMetadata.ts": "Fetches and saves custom display metadata for provider entries via actor calls.",
  "frontend/src/hooks/providers/useResolvedProviderDisplayName.ts": "Returns a provider's display name, preferring custom metadata when available.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user's identity and refreshes dependent queries.",
  "frontend/src/hooks/useBackendActor.ts": "Manages backend actor creation with connection state, error handling, and retry support.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for managing Internet Identity authentication using AuthClient, including login state and stored identities.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks to fetch the caller's user profile and admin status from the backend actor.",
  "frontend/src/index.css": "Sets up Tailwind CSS base styles and defines light/dark theme variables for the app.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/AdminPanelPage.tsx": "Renders the admin panel UI, checking admin permissions and showing feature placeholders for future tools.",
  "frontend/src/pages/KeyVaultPage.tsx": "Displays a dashboard for managing API keys across providers, showing key status and links to configuration pages.",
  "frontend/src/pages/LinksDashboardPage.tsx": "Shows a placeholder UI for future CRUD management of external links.",
  "frontend/src/pages/MemoryBrainPage.tsx": "Provides a placeholder interface for the planned RAG-based memory system called Empire Brain.",
  "frontend/src/pages/ProviderHubPage.tsx": "Lists AI providers with capabilities and links to their command centers in a card-based layout.",
  "frontend/src/pages/providers/CustomSlotProviderPage.tsx": "Renders a customizable provider page allowing users to edit display names, manage keys, use prompts, and access chat/tools sections.",
  "frontend/src/pages/providers/GenericProviderPage.tsx": "A generic provider template showing capabilities, key management, prompts, and chat/workflow tools with error handling.",
  "frontend/src/pages/providers/LTXPage.tsx": "Provider page for LTX with key input, recommended prompts, chat, and optional workflow tools.",
  "frontend/src/pages/providers/OpenAIPage.tsx": "OpenAI provider page with chat, image generation, and analysis tabs alongside key management and prompts.",
  "frontend/src/pages/providers/ReplicatePage.tsx": "Replicate provider page offering key management, prompts, chat, and any workflow tool options.",
  "frontend/src/pages/providers/RunPodPage.tsx": "RunPod provider page enabling key setup, recommended prompts, chat, and workflow tool configuration.",
  "frontend/src/pages/providers/SlackPage.tsx": "Slack provider page with key management, prompts, chat interface, and optional workflow tool settings.",
  "frontend/src/pages/StudioToolsPage.tsx": "Displays placeholder cards for upcoming studio tools like Motion Brush, Magic Script, and Generation History.",
  "frontend/src/providers/providers.ts": "Defines provider configuration types and an array of provider metadata including capabilities, routes, and option fields for the UI.",
  "frontend/src/utils/backendErrorMessages.ts": "Provides utilities to detect and classify backend errors and return user-friendly messages with suggested actions.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, storing, and clearing URL parameters with sessionStorage persistence and hash support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending colors, animations, typography, and other theme settings with plugins enabled.",
  "project_state.json": "Describes the project’s architecture, known issues, and feature requirements for a provider‑centric AI app UI."
}