{
  "backend/main.mo": "Backend actor handling provider initialization, user profiles, API key metadata, and access control with admin/user permission checks.",
  "feature_evidence.json": "Empty feature evidence report structure.",
  "frontend-file-summaries.txt": "Text file listing summaries of all frontend source files.",
  "frontend/index.css": "Tailwind CSS setup defining light/dark theme variables and base styles.",
  "frontend/index.html": "Main HTML entry with PWA manifest, icons, service worker registration, and root mount.",
  "frontend/public/manifest.webmanifest": "PWA manifest defining app name, icons, theme, and metadata.",
  "frontend/public/sw.js": "Service worker implementing precaching, runtime caching, and navigation fallback for the SPA.",
  "frontend/src/App.tsx": "App router configuring all provider and utility routes wrapped with AuthGate.",
  "frontend/src/components/auth/AuthGate.tsx": "Auth wrapper requiring Internet Identity before rendering children, with loading and login screens.",
  "frontend/src/components/auth/LoginButton.tsx": "Login/logout button managing Internet Identity auth and clearing query cache on logout.",
  "frontend/src/components/auth/ProfileSetupModal.tsx": "Displays a modal prompting authenticated users without a profile to enter and locally save their name.",
  "frontend/src/components/chat/ChatbotCommandCenter.tsx": "Provides a chat interface for sending messages to a provider, handling drafts, backend readiness, and auto-scrolling.",
  "frontend/src/components/common/BackendConnectionAlert.tsx": "Shows detailed backend connection errors with recommended actions and retry or login options.",
  "frontend/src/components/common/ErrorBoundary.tsx": "Catches rendering errors and displays a fallback UI with reset capability.",
  "frontend/src/components/common/NotIntegratedCallout.tsx": "Displays a notice indicating a feature is not yet implemented.",
  "frontend/src/components/keys/ProviderKeyManager.tsx": "Manages viewing, adding, and updating stored provider API keys with backend connection handling.",
  "frontend/src/components/layout/AppFooter.tsx": "Renders the site footer with branding and a terms link.",
  "frontend/src/components/layout/AppShell.tsx": "Wraps the main app layout with navigation, footer, and the profile setup modal.",
  "frontend/src/components/layout/MobileProviderNav.tsx": "Provides a mobile drawer listing AI providers with navigation links.",
  "frontend/src/components/layout/MobileTopNavMenu.tsx": "Implements a mobile top navigation menu linking to main app sections.",
  "frontend/src/components/layout/TopNav.tsx": "Renders the top navigation bar with logo, desktop links, mobile menu toggle, PWA install prompt, and login button.",
  "frontend/src/components/providers/ProviderActionGuard.tsx": "Checks backend connectivity and provider API key availability before rendering children, showing alerts or loading states as needed.",
  "frontend/src/components/providers/ProviderNav.tsx": "Displays a sidebar listing all AI providers with navigation links and highlights the active provider route.",
  "frontend/src/components/providers/ProviderToolsOptionsSection.tsx": "Provides a dynamic form to configure and execute provider workflows, manage runs, and trigger image generation.",
  "frontend/src/components/providers/RecommendedPrompts.tsx": "Shows a list of suggested prompts that users can click to insert into an input field.",
  "frontend/src/components/pwa/PwaInstallPrompt.tsx": "Displays install options for the PWA, including browser install prompts or iOS instructions when applicable.",
  "frontend/src/components/workflows/ExecutionResultPanel.tsx": "Displays workflow run status, inputs, metadata, and an optional reuse action.",
  "frontend/src/components/workflows/GenerationHistory.tsx": "Shows past workflow runs with status, previews, and actions like download, share, or reuse.",
  "frontend/src/components/workflows/GenerationResult.tsx": "UI component displaying workflow run status, actions (cancel, download, share), and input/output details.",
  "frontend/src/hooks/chat/useProviderChat.ts": "Hook managing chat messages for a provider, including fetching and sending with error handling.",
  "frontend/src/hooks/keys/useProviderKey.ts": "Hooks for checking if a provider API key exists and saving or updating it through backend calls.",
  "frontend/src/hooks/providers/useCustomProviderMetadata.ts": "Hooks to fetch and save custom provider metadata such as display names.",
  "frontend/src/hooks/providers/useResolvedProviderDisplayName.ts": "Resolves a provider's display name, using custom metadata when available.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to user identity, invalidating dependent queries on change.",
  "frontend/src/hooks/useBackendActor.ts": "Manages backend actor with retry logic and readiness state, using identity when available.",
  "frontend/src/hooks/useInternetIdentity.ts": "Manages Internet Identity auth state, login flow, and exposes identity context.",
  "frontend/src/hooks/usePwaInstallPrompt.ts": "Handles PWA install prompt logic, detecting install state and enabling manual prompting.",
  "frontend/src/hooks/useQueries.ts": "Hooks to load the caller's user profile and admin status from the backend.",
  "frontend/src/hooks/workflows/useCancelWorkflowRun.ts": "Mutation hook to cancel a workflow run and refresh related queries.",
  "frontend/src/hooks/workflows/useClearPendingWorkflowRunsForProvider.ts": "Mutation hook to clear pending workflow runs for a provider and refresh queries.",
  "frontend/src/hooks/workflows/useImageGeneration.ts": "Hook to generate images via backend workflows, updating run status and handling success or error states.",
  "frontend/src/hooks/workflows/useWorkflowExecution.ts": "Provides mutations to execute workflows and update workflow runs, with query invalidation and error handling.",
  "frontend/src/hooks/workflows/useWorkflowRuns.ts": "Fetches workflow runs for a provider with polling for pending or running states.",
  "frontend/src/index.css": "Defines Tailwind base styles and CSS variables for light and dark themes.",
  "frontend/src/main.tsx": "Initializes the React app with query client and Internet Identity provider.",
  "frontend/src/pages/AdminPanelPage.tsx": "Admin panel page showing admin-only tools, currently placeholder cards with access control.",
  "frontend/src/pages/KeyVaultPage.tsx": "Displays all providers and their API key status with links to manage each key.",
  "frontend/src/pages/LinksDashboardPage.tsx": "Placeholder page for managing external links, showing non-integrated callout.",
  "frontend/src/pages/MemoryBrainPage.tsx": "Placeholder page describing future RAG and memory system features.",
  "frontend/src/pages/ProviderHubPage.tsx": "Lists AI providers with capabilities and links to their command centers.",
  "frontend/src/pages/providers/CustomSlotProviderPage.tsx": "Provides a customizable provider page allowing users to rename the provider, manage API keys, view prompts, and configure tool options.",
  "frontend/src/pages/providers/GenericProviderPage.tsx": "Generic provider interface with tabs for chat and tools, integrated key management, recommended prompts, and workflow options.",
  "frontend/src/pages/providers/LTXPage.tsx": "A provider-specific page for LTX offering key management, recommended prompts, and workflow tool configuration.",
  "frontend/src/pages/providers/OpenAIPage.tsx": "OpenAI provider page with tabs for chat, image generation, and analysis, including custom tool sections and key management.",
  "frontend/src/pages/providers/ReplicatePage.tsx": "Replicate provider interface featuring key management, recommended prompts, and configurable workflow tool options.",
  "frontend/src/pages/providers/RunPodPage.tsx": "RunPod provider page providing key management, recommended prompts, and workflow tool configuration.",
  "frontend/src/pages/providers/SlackPage.tsx": "Renders the Slack provider page with key management, prompt selection, and provider options. Manages a draft message and displays recommended prompts and tools.",
  "frontend/src/pages/StudioToolsPage.tsx": "Displays the Studio Tools dashboard with cards for Motion Brush, Magic Script, and Generation History, each marked as planned future features.",
  "frontend/src/pages/TermsPage.tsx": "Renders the Terms & Conditions page with sections covering usage rules, API key responsibility, privacy, and disclaimers.",
  "frontend/src/providers/providers.ts": "Defines provider configuration types and a list of provider metadata including IDs, routes, capabilities, options, and recommended prompts.",
  "frontend/src/services/imageGeneration.ts": "Implements image generation via OpenAI, Fal.ai, and Stability AI, handling API requests, prompt assembly, and returning image URLs and data.",
  "frontend/src/utils/artifacts.ts": "Provides utilities for artifact URLs, download handling (placeholder), MIME type detection, and filename generation.",
  "frontend/src/utils/backendErrorMessages.ts": "Classifies backend errors into user-friendly messages with indicators for network, authentication, and canister issues.",
  "frontend/src/utils/share.ts": "Shares artifact URLs using the Web Share API with clipboard fallback. Includes a helper to detect share support.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading, persisting, and clearing URL parameters across query strings and hash-based routing using sessionStorage.",
  "frontend/tailwind.config.js": "Tailwind config enabling dark mode, custom OKLCH color tokens, extended theme settings, animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project state metadata describing the app’s provider‑centric architecture, capabilities, known issues, and existing feature definitions for continued development."
}