{
  "backend/main.mo": "Actor managing providers, user profiles, custom metadata, and access control with admin/user‑gated mutations and queries.",
  "backend/migration.mo": "Migration module converting old actor state to new format by adding workflowRuns and nextWorkflowRunId fields.",
  "feature_evidence.json": "Feature evidence report mapping features to affected files, components, and test IDs.",
  "frontend-file-summaries.txt": "List of prewritten summaries describing the purpose of various frontend files.",
  "frontend/index.css": "Tailwind CSS setup defining theme variables for light and dark modes.",
  "frontend/index.html": "Base HTML entry file mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Main React router configuration defining authenticated routes for all provider pages and app sections.",
  "frontend/src/components/auth/AuthGate.tsx": "Authentication guard that blocks content until Internet Identity login is complete or successful.",
  "frontend/src/components/auth/LoginButton.tsx": "Login/logout button using Internet Identity, handling authentication state and retry logic.",
  "frontend/src/components/auth/ProfileSetupModal.tsx": "Modal prompting new authenticated users to enter and locally store a profile name until backend support exists.",
  "frontend/src/components/chat/ChatbotCommandCenter.tsx": "Chat interface for provider-specific messaging with backend connection checks, message history, and draft syncing.",
  "frontend/src/components/common/BackendConnectionAlert.tsx": "Displays backend connection errors with suggested actions and retry or login options.",
  "frontend/src/components/common/ErrorBoundary.tsx": "React error boundary that catches component errors and displays a resettable fallback UI.",
  "frontend/src/components/common/NotIntegratedCallout.tsx": "Callout component indicating a feature is not yet implemented.",
  "frontend/src/components/keys/ProviderKeyManager.tsx": "UI for viewing, adding, and updating provider API keys with backend readiness and error handling.",
  "frontend/src/components/layout/AppShell.tsx": "Main layout shell providing navigation, routed content, and automatic profile setup modal.",
  "frontend/src/components/layout/MobileProviderNav.tsx": "Mobile sidebar listing AI providers with navigation and current-route highlighting.",
  "frontend/src/components/layout/MobileTopNavMenu.tsx": "Mobile top-nav menu offering quick navigation links to major app sections.",
  "frontend/src/components/layout/TopNav.tsx": "Renders the top navigation bar with logo, desktop links, mobile menu, and login button.",
  "frontend/src/components/providers/ProviderActionGuard.tsx": "Guards provider actions by checking backend connection and API key availability before rendering children.",
  "frontend/src/components/providers/ProviderNav.tsx": "Displays a sidebar listing available AI providers with navigation links and active state highlighting.",
  "frontend/src/components/providers/ProviderToolsOptionsSection.tsx": "Handles workflow option inputs, execution, run tracking, and result display for provider tools.",
  "frontend/src/components/providers/RecommendedPrompts.tsx": "Shows a list of clickable recommended prompts that can be inserted into the command box.",
  "frontend/src/components/workflows/ExecutionResultPanel.tsx": "Displays workflow run status, inputs used, metadata, and an option to reuse parameters.",
  "frontend/src/components/workflows/GenerationHistory.tsx": "Shows a scrollable history of workflow runs with actions to download, share, or reuse past results.",
  "frontend/src/components/workflows/GenerationResult.tsx": "Renders workflow run status, preview, and provides download and share actions for generated artifacts.",
  "frontend/src/hooks/chat/useProviderChat.ts": "Provides chat message querying and sending for a given provider using backend actor and React Query.",
  "frontend/src/hooks/keys/useProviderKey.ts": "Fetches whether a provider key exists and provides a mutation to save or update a provider API key.",
  "frontend/src/hooks/providers/useCustomProviderMetadata.ts": "Loads and saves custom provider metadata such as display names via actor queries and mutations.",
  "frontend/src/hooks/providers/useResolvedProviderDisplayName.ts": "Resolves a provider’s display name, preferring custom metadata overrides when available.",
  "frontend/src/hooks/useActor.ts": "Creates and manages an authenticated or anonymous backend actor instance, refetching dependent queries when identity changes.",
  "frontend/src/hooks/useBackendActor.ts": "Initializes a backend actor with optional identity and admin token handling, exposing readiness and retry state.",
  "frontend/src/hooks/useInternetIdentity.ts": "Manages Internet Identity authentication state, including login, logout, identity loading, and status tracking.",
  "frontend/src/hooks/useQueries.ts": "Provides queries for fetching the caller’s user profile and checking admin status using the backend actor.",
  "frontend/src/hooks/workflows/useWorkflowExecution.ts": "Runs workflows and updates workflow runs via mutations, invalidating related queries on success.",
  "frontend/src/hooks/workflows/useWorkflowRuns.ts": "Fetches workflow runs for a provider and periodically polls when runs are pending or running.",
  "frontend/src/index.css": "Defines Tailwind base layers and CSS variables for light and dark themes including color and layout tokens.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers before rendering App.",
  "frontend/src/pages/AdminPanelPage.tsx": "Admin-only dashboard showing placeholder cards for future management tools and permission checks.",
  "frontend/src/pages/KeyVaultPage.tsx": "Displays provider API key status cards and links to manage keys for each provider.",
  "frontend/src/pages/LinksDashboardPage.tsx": "Shows a placeholder interface for future CRUD management of external links.",
  "frontend/src/pages/MemoryBrainPage.tsx": "Provides a placeholder UI for a future RAG-based memory system called Empire Brain.",
  "frontend/src/pages/ProviderHubPage.tsx": "Lists all AI providers with descriptions, capabilities, and links to each provider's command center.",
  "frontend/src/pages/providers/CustomSlotProviderPage.tsx": "Allows editing custom provider metadata, managing keys, and interacting with chat/tools for a custom provider slot.",
  "frontend/src/pages/providers/GenericProviderPage.tsx": "Generic provider dashboard offering key management, chat, tools, and recommended prompts based on provider config.",
  "frontend/src/pages/providers/LTXPage.tsx": "Renders the LTX provider page with key management, prompt selection, chat interface, and optional workflow tool options.",
  "frontend/src/pages/providers/OpenAIPage.tsx": "Renders the OpenAI provider page with tabs for chat, image generation, and analysis, plus key management and chat functionality.",
  "frontend/src/pages/providers/ReplicatePage.tsx": "Renders the Replicate provider page including key management, recommended prompts, chat interface, and workflow tool options.",
  "frontend/src/pages/providers/RunPodPage.tsx": "Renders the RunPod provider page with key management, recommended prompts, chat interface, and custom workflow option inputs.",
  "frontend/src/pages/providers/SlackPage.tsx": "Renders the Slack provider page with key management, chat interface, recommended prompts, and optional workflow tool options.",
  "frontend/src/pages/StudioToolsPage.tsx": "Contains placeholder cards for upcoming studio tools like motion brush, magic script, and history.",
  "frontend/src/providers/providers.ts": "Defines provider configurations, workflow types, option fields, and metadata for all supported providers.",
  "frontend/src/utils/artifacts.ts": "Utility functions for artifact URLs, downloads (placeholder implementation), MIME type detection, and filename generation.",
  "frontend/src/utils/backendErrorMessages.ts": "Provides utilities to classify backend errors and generate user-friendly messages and action steps.",
  "frontend/src/utils/share.ts": "Provides a function to share an artifact via the Web Share API with clipboard fallback and a helper to detect support.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading URL parameters, persisting them in sessionStorage, and managing hash-based parameters.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining theme extensions, colors, animations, fonts, and plugins including typography, container queries, and animations.",
  "project_state.json": "Describes the project’s current architecture, features, issues, and versioned state for an AI provider–centric app."
}